app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("name", "drink_ordered", "price", "rating", "address") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Latte Art"], ["drink_ordered", "latte"], ["price", 4.5], ["rating", 3], ["address", "15 stone street, new york, new york, 10004"]]
---
  def create
    @review = Review.create(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "reviews" SET "name" = $1 WHERE "reviews"."id" = $2  [["name", "starbinks"], ["id", 12]]
---
  def update

    @review = Review.find(params[:id])

    @review.update(review_params)